{
  "name": "Alice_Fabric_Accent_Chair", 
  "price": "EUR 109.29", 
  "reviews": [
    "Short for a chair, not great quality. I bought them for an office where the back of the chair would be visible, too bad there is a big white zipper going down the length of the back:(", 
    "Great fit for my office. It has a nice modern look and it was very easy to assemble. My only complaint would be that the seat sits lower than a typical chair, so look at the dimensions to ensure it works for you.", 
    "The chair was easy to assemble and it only took me 20 minutes to put together. This was chair I added to my living and it look nice, just wish it was a little bigger.", 
    "The price on the chair is what caught my attention. I needed to replace 2 worn chairs and these were the right size, color, and price. Love the style! My room looks a bit updated from just replacing the old chairs. My husband and son said they were a breeze to assemble also. The main drawback is there is little cushioning in the seat area. Fortunately these chairs are the least used in the room. But, if you plan on use them all the time, you may want to purchase some with a bit more padding. Also, they are fairly short, or at least shorter than what I had before so that was an adjustment also. All in all, I am pleased with my purchase.", 
    "It's a great chair for the price!", 
    "00000000000000000000000000", 
    "easy to assembly, the chair is exactly as you see it", 
    "This looks more like a doll-house chair. It is low, but rather comfortable. I got it for a small, guest bedroom and it works.", 
    "This chair is a great buy! Easy to put together and great quality.", 
    "I stage homes for a living, so I am not sure of the durability; however, they look fabulous and are easy to move from project to project. Great deal for the money!", 
    "Easy to put together. Nice accent piece.", 
    "Easy to put together and looks great in the guest room. When the box arrived it was labeled with the wrong color, but when I opened it the chair was the color I ordered.", 
    "Very cute for a small space, comfortable and easy to put together!", 
    "it is a bit too low on the ground but blends in well", 
    "This chair is great looking, good quality, and best of all, comfortable! The assembly is super simple and doesn't take long. The end result looks very nice. Great value.", 
    "This chair is simple and sturdy. It was better than I anticipated", 
    "I got this for my bedroom. It's perfect & so easy to put together."
  ], 
  "descrpition": "Update your home or office with this chic and contemporary accent chair. A product of a comfortable and modern design, the plush foam fill ensures hours of comfort for you or a guest. With its solid fabric upholstery, this modern accent chair pairs well with a colorful pillow or a vibrant throw cover to complete the classy design.\nSet includes: One (1) accent chairMaterials: Fabric, wood legsFinish: BlackUpholstery color: Grey, brown or beige solid or brown, blue or grey flower patternUpholstery fill: FoamSeat dimensions: 16.2 inches high x 19.5 inches deepDimensions: 31.5 inches high x 23.7 inches wide x 28.5 inches deep x Weight: 19 poundsStyleContemporary, ModernMaterialFabric, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBeige, Blue, Brown, GreyFurniture PatternSolid", 
  "link": "http://www.overstock.com/Home-Garden/Alice-Fabric-Accent-Chair/9785744/product.html?recset=2eec4704-d42e-4c0c-aa0d-18548e18adc8&refccid=VEJUK3U7PESZIBKCH2YU5BOHFA&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9785744/Alice-Fabric-Accent-Chair-9835c9f7-1151-4b1b-acf4-ae1537e14bb2_600.jpg"
  ]
}