{
  "name": "angelo:HOME_Bradstreet_Black_and_White_Damask_Upholstered_Armless_Chair", 
  "price": "EUR 158.10", 
  "reviews": [
    "This chair is the perfect compliment to my black and white leather furniture. It pulled my living room together nicely. Would definitely recommend.", 
    "Bought two for my teen daughters room and they are perfect for her and a friend", 
    "I love this da mask line. It's diversified, good quality, and can use in either, a bedroom or living room. I have two chairs with ottoman in between under window. Black & white, makes the room! Easy to put together, lightweight, can move easily. Comfortable and looks great.", 
    "Colors are a vivid b&w, not the vintagey distressed look. Very cushy. Perfect addition in walk-in closet. Seat is large enuf to get up on cross-legged. Quite cozy and comfy indeed. A chair you can kinda snuggle into for awhile.", 
    "This chair is beautiful and looks just like pictured. It is comfortable if you sit on it properly however if you are just sitting on the edge you can feel the frame. It is a great value for the money spent.", 
    "I really like this chair. I found the photograph to be accurate. The seat is wide and deep while the back is shorter. I put a pillow on the seat, using the pillow makes it a comfortable chair. It has different and eye catching proportions. The material is lovely. Easy to assemble. As with all Overstock furniture, be sure to assess the measurements for your needs and desires, study the picture and read the reviews.", 
    "Easy to put together, my teen did it quickly. Nice chair. Very light, worry about how it will hold up over time. Very pleased for the price. I should have bought two. Good sized. Very pretty.", 
    "I really like this slipper chair, BUT, the legs are no even and it required my to put a little felt pad under one leg.Other than that, it does the job I was looking for - I have a light grape colored room with black and white accents). It's a nice print without being too busy and overwhelming the room.", 
    "Beautiful fabric and it complements the setting beautifully. I love the chair. It is well made and quite sturdy, It works nicely with my vanity,", 
    "I bought this chair for my dining room, it gives it an elegant look. The chair is not heavy and solid, but I didn't buy it for heavy everyday use. I am thinking about buying another one", 
    "The seat is soft, the back is firm, the chair as a whole is sturdy and looks very stylish! I bought the matching ottoman and the pair can be combined to create a chez, or they can sit separately and bring a pop of style and design to your room. The chair was very easy to assemble, which was great. The fabric the chair is upholstered in is very durable, and is easily cleaned with a \"tide pen\" or \"resolve\" when needed.", 
    "Chairs are as described and pictured. Pattern is perfect for space intended, just the right pop. A little challenging w/the assembly but we figured it out. Nice fabric and very comfy and soft. Great value for quality.", 
    "We've looked at these chairs on all sites. The fabric of this particular chair is absolutely beautiful and matches so many other colors and items. It looks very elegant.", 
    "Love this chair!! Looks great in our bedroom, but would look great in any room. Was super easy to put together, and is lightweight enough to move on my own. It is very durable feeling though, both the frame and the fabric.", 
    "Bought this as an accent chair. Super cute. Decent chair for the money. Fairly easy to put together.", 
    "Excited about my new chairs. Seem sturdy and comfortable. A little bigger than I thought they would be but still pleased with product.", 
    "looks better in the room than on the website. also looks like a high end designer chair. comfy. easy to put together (essentially two pieces and four legs).", 
    "I was disappointed when I saw the actual product because the color looks dull, I was expecting a bright black and white chair, the actual color is dark beige and black and it doesn't look good with my existing red couch.", 
    "I love this chair, it looks so decorative in my bedroom. It's a very comfortable, and the seat or back is not hard at all. The only problem I have is the small parts in the back of the chair and that are inside of the legs dislodge easily. The legs problem is nothing a hammer and some patience can't fix, however, the small parts lodge in the back of the chair (the tiny metal pieces that catch the ridges of the screws) caused me to have to ask customer service to send out a whole new chair. However, the chair is totally worth it. Like I said, wonderful!", 
    "I use this chair in our bedroom and it ties everything together beautifully!", 
    "I use this chair in a Guest room. It is a nice addition to the room. the chair is very light weight and probably would not take alot of abuse. It is comfortable but it has a deep seat. I am very happy w/ the chair. It definitely serves my purposes.", 
    "This chair is great. I put it in my bedroom and it is perfect for a little sitting area where I can relax and read a book and add a little decoration to my room. I have been looking for a chair like this for a LONG time. I have never found a chair that has the entire package of what I've been looking for for months: the structure, design, colors, and affordability. I can see myself keeping this chair around for a while.", 
    "I like my two chairs. They were easy to assemble and the color is bright and beautiful.", 
    "I ordered 2 chairs, overall they are good chairs. However the quality of the legs and its screws are done poorly. The screws came right off from the legs after my husband put them together. We had to use heated glue to secure screws and the legs together. I would rate these 2 chairs perfect score if we did not have any problem with the screws on the legs. We are really happy with the color and the size of the chairs.", 
    "Need an accent piece for a living area? Have only minor assembly skills? Working on a limited budget? This is an outstanding purchase. I purchased the black and white version as an accent piece for a living area. It is comfortable, colors are bright and not muddied and was easy to assemble. Very happy with this purchase.", 
    "I ordered two of the HOME Bradstreet Black and White Damask Armless Chairs for my living room. They are comfortable and I am pleased with the quality. I have searched every furniture store in my city and have been unable to find anything I like for less than $400 per chair. I am very happy with the chairs!", 
    "I don't know what to say. I really, really enjoy my chairs. I admired them for hours when I first got them; I still do. They are a tremendous focal point in my living space. They are really very beautiful and I love the damask pattern. Very striking and gorgeous!", 
    "Just received this chair yesterday, but already knew it would be comfortable as I had previously purchased a settee from Angelo:Home through OverStock... very happy with both and so comfortable to sit on. Was well packaged for shipping, and parts were clearly marked - easy to assemble. Very happy with this chair!"
  ], 
  "descrpition": "This transitional upholstered armless chair features a mesmerizing\ndamask geometric pattern in black and white colors, which is\nguaranteed not to pass unobserved in your office or home. Designed\nby Angelo Surmelis, this armless chair offers great seating comfort\nand durability, thanks to its plush cushions and sturdy hardwood\nframe. The production of this eco-friendly piece minimizes fossil\nfuel-based components, and most of its materials can be further\nrecycled. Finish: Dark espressoFrame materials: Sturdy hardwoodUpholstery color: Black and creamy off-whiteUpholstery materials: Poly-blendLegs: Tapered wood legs with a dark espresso finishDesigned by Angelo Surmelis, creator of a new generation of\n  Modern Classic furniture that combines modern lines with\n  traditional detailsGently tapered back and legs give this chair a touch of\n  eleganceSmall scale chair with generous seating comfortPerfect for the living room, dining room or office decor, the\n  scale of this chair coordinates well in any room environmentInnovative engineering and packaging design enable upholstery\n  to be easily assembled in the actual roomEco-friendly and efficient product design uses less fossil\n  fuel based components in construction and deliveryVarious components are recyclable at the end of useDimensions: 33 inches high x 26 inches wide x 29 inches\n  deepSeat: 18.5 inches high x 26 inches wide x 22 inches deepStyleModern, Traditional, TransitionalMaterialFabric, Polyester Blend, Upholstered, WoodFinishBlack, Espresso, Iron, White, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlack, WhiteFurniture PatternDamask, Geometric", 
  "link": "http://www.overstock.com/Home-Garden/angelo-HOME-Bradstreet-Black-and-White-Damask-Upholstered-Armless-Chair/6493827/product.html?recset=ae644fcd-ef6d-4dcf-9ad0-029f6687883d&refccid=45UXE7Z4IL3IHXKO33MTWQ4DCQ&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6493827/angelo-HOME-Bradstreet-Black-and-White-Damask-Upholstered-Armless-Chair-4bfaf84e-85c4-46fc-8062-80794e894895_600.jpg"
  ]
}