{
  "name": "angelo:HOME_Bradstreet_Damask_Turquoise_Blue_Armless_Chairs_(Set_of_2)", 
  "price": "EUR 307.76", 
  "reviews": [
    "Very poor quality, legs on both chairs have broken several times during the few months I have owned these chairs. I would never buy these again, nor any other product from this manufacturer.", 
    "These chairs are nice, they look great and are much bigger than I had imagined. Plenty of space to sit on. My only problem with them is putting them together. I had to buy some putty and use liquid nails to hold some of the screws in place with the legs. Now it is incredibly solid, but I wouldn't trust it without those additions. The screws strip way too easily and the wooden legs kind of float in the center of the socket. Get a tight fit by stuffing the holes and then glue the screws in place.", 
    "So these chairs are cheaply made, but they are the right level of cheap where I know they'll last at least a few years and if I want to reupholster them later, I'll be able to. I loved the price compared to other items. They were easy to assemble. Each of my chairs had a defective leg though which attaches but then wobbles. They are small enough that they don't crowd my living room, but they are large enough that I can curl up in the chair with my legs next to me in the chair which is something I appreciate. Slightly different looking in person than I imagined (seat larger in width than the back), but they're really great.", 
    "Well, I basically built my entire living room around these chairs. I wanted to do turquoise and coral, with a few other accent colors. I've been buying everything online, so as it all has been coming in I've been very excited to complete the room. I just got the chairs this evening (shipping took longer than expected), and I can't even bring myself to put them together. I'm SO DISAPPOINTED. The color is not turquoise, it is TEAL. Way more green undertones than blue. So I have a turquoise/coral living room, and GREEN chairs. They are so beautiful, the size is great, but the color is WAY off. If you are looking for turquoise chairs, look elsewhere because you'll be getting green instead of blue. So disappointed, I was so looking forward to these chairs in my living room!!!", 
    "Pretty accent chair, we don't sit on it that much except if there's visitor and we need extra sitting. One leg wobbled after my husband assembled it. One bolts doesn't bite into the wood so he added nail to secure it. If our ooking for a sturdy chair to sit every single day, this is not the one.", 
    "These chairs are gorgeous, brings style and elegance into the room. I painted my main wall turquoise and have these two chairs as my accent chairs.... Speechless. Hands down I would recommend this product to anyone. These chairs catch your eye immediately once you walk into the room. The cushion for the base of the chair is wider than expected but still looks awesome.", 
    "We purchased these almost 2 years ago for our living room. The legs are poorly made, but the actual chairs are gorgeous.", 
    "The fabric is beautiful and that it! Legs are cheap, fell apart before I put it together!", 
    "The first thing our guests notice are the chairs. They definitely make a statement, and seem to be the main attraction in our livingroom. Thank you so much Overstock for putting them on sale; they were on my Pinterest board forever!", 
    "Great accent chairs, color matched photo, good quality.", 
    "I love the color I just wish they would have been a little taller in the back.", 
    "Only got 2 stars because the print is so beautiful. Craftmanship and quality are a joke. Back is already coming apart and legs chipped even before we got it out of the box. Only keeping until I can afford real furniture.", 
    "Came exactly as described and shipping was on time! Comfortable chairs with good cushion. A little difficult to assembly for me but that was minor compared to the use and overall look of the chairs. I certainly recommend!", 
    "nice, good quality, good price", 
    "The chairs assemble easily and look really nice.", 
    "Had these chairs for a few years now. They are still holding up and most importantly the bright color is still there!! Stains come right off!", 
    "The whole purchase process was cheap and painless. I got a great deal on these beautiful chairs and anytime someone comes over, they are the first thing they notice in our living room. Friend and family also comment on how comfortable they are. My husband and son remarked how easy they were to assemble. A must buy!", 
    "Nice design, lovely color and easy to assemble. More turquoise than blue. The photo shows the true color.", 
    "I loved the color and hence I ordered them. First time around I got a wobbling leg and i was annoyed . Obviously! Then I contacted customer care who wanted to give me some discount and I was like what am I going to do with a wobbling chair!! So they sent me a new one and I sent them the old one back . [ TOO MUCH WORK ]. Mainly coz I assembled one and unassembled it and had to send it back. But the chair itself is really nice and huge compared to regular chair size. Color gives character to my living room. But I trust Overstock because they sent me a new chair and handled the return shipping etc. Otherwise I would never have returned to this site!", 
    "I received chairs when expected. Color exactly as I pictured from online. Comfy and sturdy. One leg on each chair had minor scratches but nothing a little cherrywood stain can't fix. No one but me would notice anyways. Easy to put together and all pieces/parts were in the package. Comes with the tool to put screws in so you need nothing but time. Put both together in less than 15 minutes. Great deal and looks amazing!", 
    "These chairs are awesome! Very cool design with a roomy and comfortable seat with very sturdy legs made of a high quality wood. The color is hip and they really make my sitting area room \"pop\" with personality! Really nice looking - I'd buy them again!", 
    "I ordered these chairs and they were delivered on a day of heavy rains and left in the driveway and ruined. Overstock replaced them for free, and I absolutely love them. They are comfortable and work in a bedroom, living room, or at a table. They were easy to put together and the fabric goes with everything and makes an orange or yellow pillow really pop. Plus they seem to be holding up very well to my cats' claws. Great chairs, great customer service!", 
    "I was skeptical on purchasing the chairs due to the reviews, but it was no problem putting the chairs together and it makes the room so bright!", 
    "Love love loved the color onto these chairs. Had to fit my color scheme perfectly and a lot of research went into this purchase. They were on sale for a pair when I got them and with the price in mind - the chairs can't be beat.", 
    "just as pictured and decent quality. easy to put together. bought originally to stage a family room to sell house. love them so much, brought them with me and they now brighten up the family room here. aqua contrasts great with a brown leather couch and turquoise accent pieces like vases", 
    "When we opened them, we thought they were going to be too bright and turquoise with our other furniture but they look great and we get many compliments on them!", 
    "Love these. Beautiful fabric. Great price. The color is Awesome in my tropical living room. These would also make great dining room chairs.", 
    "We received these chairs a few weeks ago. Assembly took a little time but not bad, just had my husband do that last tightening of the screws to ensure they were tight. One chair has a slight indention in the uphoulstry. Not sure if it is due to packing or permanent. Still showing after a few weeks. These chairs add a nice splash of color to our otherwise neutral toned living area.", 
    "I received the chairs pretty quickly after ordering. I was however disappointed when they arrived. They were dirty and it seems as if I received an item that was returned or was not properly stored. I contacted customer service and they were very quick in responding. The return process was painless and the replacement actually left their warehouse prior to me sending the original back. I am very pleased with this purchase and I must state that it has added the right touch to my living room.", 
    "Easy to put together, with good instructions. The color was good and the size fit perfectly in the space available. I have ordered from Overstock since I ordered the chairs and have well pleased with the quality. If I need something else, I will order from you again.", 
    "The chairs are pictured large with wide seats and they are exactly as pictured. The color is excellent and they are sturdy. The assembly was easy and well put. We liked them very much. It is good to know that we can place more orders in a trustworthy place like Overstock.", 
    "Everyone who comes to my house compliments me on them - and i had a small damage but the customer service at overstock was so good - i was very impressed and i love my purchase!", 
    "Perfect for my turquoise room . Legs are black and not a bright white but white all the same!", 
    "I am very happy with these chairs. When I put them together I was so proud of myself for getting all the legs lined up (which was a bit challenging) and getting them tightened wasn't easy. When I stood them up they were so wobbly. I had to lay the chairs back down on their sides and really hold and push the legs as tight as I could get them to seal up close. The second time worked great and they are very sturdy now. There was an issue with one of the chairs lacking some stuffing in a small area but I can fix it will fiberfil. Customer service on this product was excellent by the way!", 
    "They are comfy and look amazing in my space!", 
    "I LOVE IT!!!!!!!!!!!!!!!!!!!!!!!!!", 
    "Great buy wonderful for visitors my parents favorite seats", 
    "Very solid, comfortable, well made and easy to assemble.", 
    "Great price and amazing product", 
    "Great deal for the money. Beautiful color and style. Not very comfortable. I would recommend in room to add style .", 
    "Love them! Suite my room perfectly, easy to put together, shipping was a breeze.", 
    "Very happy with my purchase.", 
    "I don't know why the other reviews say the legs aren't sturdy. I think they are pretty great. These chairs are beautiful!", 
    "Really like the chairs. They look just like the picture. Confortable as well.", 
    "Great price and quality the chairs are a good sizes overall very happy.", 
    "Arrived in two days, they are great chairs, will make a great asset to our new room.", 
    "I bought these as accent pieces and am very pleased. They are a good size and are very sturdy. The color is very beautiful. I get compliments on them all the time.", 
    "Very nice chairs, everyone love them .good quality.", 
    "I like these chairs a lot they match the decor in the bedroom however if you're going to buy them to really use them a lot I wouldn't do it.", 
    "Love the quality and the price", 
    "I get so many compliments on these chairs! The only negative I can say about them is that they're not super comfy. So if you're planning on sitting in them a lot, I would look for something else.", 
    "Sturdy, beautiful accent chairs that will make a statement in any room. Love them!", 
    "Easy to construct, sturdy and comfortable. Love the colour. For the price, this was a great deal.", 
    "These chairs are really pretty but are definitely a jade green turquois not the bight blue shown online. The seats are oddly oversized compared to the back. I love the fabric but don't know how long it will hold up. One of them has a giant divit in the stuffing along the front edge. Because I plan to place it in a guest room with little use I did bother with the hassel of sending it back. However, for the extremely low price the quality is what I expected and I knocked 2 stars off for the missing stuffing but I am happy with them", 
    "These chairs are beautiful. The color pattern (medallions) of the fabric \"matches\" up perfectly. They are not teal, but as color represented in the photo. They are also substantial in size, and sturdy.", 
    "these chairs are fine for accent chairs that are hardly used.", 
    "I bought these for my daughter's bedroom and they a great! Beautiful color and sit very well!", 
    "These chairs are beautiful, exactly the turquoise/teal color I had hoped for. However, in the product description, it stated the legs were an Espresso color. I wanted these chairs to go with other furniture that I have in espresso. The legs are, without a doubt, black. I would like espresso colored legs for the chairs, as described.", 
    "Love these chairs. They're absolutely beautiful and very easy to assemble. I don't expect them to last forever but they're great for now!", 
    "I love these chairs. The color and design is beautiful and the oversized shape is very comfortable. They are however a lower chair so be aware of that when buying.", 
    "Bold and daring color would look in any room in the house Makes my back patio look like I had someone come in to design a great relaxing backyard", 
    "The chairs are beautiful for the price.", 
    "easy installation, nice material", 
    "Bought 2 sets and one of the 4 chairs was missing stuffing in the front of the seat. Disappointing.", 
    "I LOVE these chairs! They look just like they do in the picture and are extremely comfortable. I get tons of compliments on them. Great buy.", 
    "WOW!!!! We love theses chairs..... And the color is beautiful...... Pops out every time we walk in the room......Couldn't be happier!!!!!!", 
    "Love the chairs! The colors are vivid. They sit ok, however they are mainly for decoration.", 
    "U absolutely adore my chairs!! Everyone complements on them. They are gorgeous. To me the color leans more towards teal. But that's exactly what I wanted. Beautiful!!!", 
    "The chairs are so cute! They look perfect in our guest room!", 
    "I love these chairs! They look great! One of them did come with a dent in the cushion from being packaged too tightly, but Overstock was so easy to work with to get it replaced with one in perfect condition at no cost to me!", 
    "we love these chairs. They look beautiful in my living room.", 
    "I snatched these two beauties for a very good price I didn't expect them to be so gorg. I would recommend.", 
    "I listened to other reviewers and used some wood glue while assembling. They are very sturdy chairs and are beautiful in my sunroom with coral accents.", 
    "Everybody loves my chairs", 
    "These chairs look so awesome in my room & are super comfy!!", 
    "Spices up the loft just right. Very attractive. Do not hesitate to purchase.", 
    "Loved these, great quality and worth the price", 
    "Cute chairs, great accent pieces but not very sturdy and wouldn't use heavily. the leg arrived chipped in the back. I have them next to my fireplace and the color really pips.", 
    "I love color so when I saw these chairs I had to have them. Once I saw how much they made my living room come alive I knew I wanted more of them or others in the same design. I haven't ordered the armchair yet but I will. In a well lit room, the light makes them radiate charm and life.", 
    "Exactly what I was looking for to bring some color into my living room. Love them.", 
    "These chairs are very beautiful and go perfectly in my room. However, they are absolutely not turquoise blue as they look in the picture. The color is definitely green or blue green as other reviewers have mentioned. They are bright, sturdy, and look great, but they're not turquoise.", 
    "These chairs I purchased for a Spa room at work. I wanted to use some bright colors to add life to the beige room. These chairs were so cute and just right for the space.", 
    "Overall, I am pleased with this purchase. I recently had a housewarming and the chairs were definitely a crowd pleaser! I'll be honest, trying to find matching throw pillows for the white couch that I paired the chairs with hasn't been easy, but I think the chairs are WORTH IT!", 
    "The chairs are very comfortable and look great.Overall the chairs are nice and more of an accent piece, I certainly wouldn't recommend it for more weight then 200lbs.", 
    "These are beautiful chairs and I get so many people who tell me how pretty. Just love them", 
    "Ordered this pair of elegant slipper chairs to compliment the master bedroom! Worked perfect :)", 
    "Lovely Set...I would recommend getting a rug to go underneath for added accent", 
    "OK, hard to review this. If you are handy with a drill, you should not hesitate. The problem is that there are some small brackets that go into the wooden legs that the screws then screw into. The brackets COME OFF when you tighten the screws. So, the chairs end up completely wobbly. My dad is handy and was able to drill long screws in to fix the problem easily. They look beautiful and are very sturdy now. But don't buy these unless you are a wee bit handy.", 
    "After reading the reviews, I have to admit I was a little skeptical, but I took the plunge and ordered. The shipping was lightening fast, the color true to the picture and the assembly a breeze! The chairs are the focal point of my living room and everyone remarks about them as soon as they see them. They are comfortable and made remarkably well. I am so glad I purchased them. No complaints at all!", 
    "i bought these chairs for my business. the color leans more toward green than blue, but it works for me. they are not the most comfy chairs, but for my purposes they are fine. guests sit in them for maybe an hour at a time. i wouldn't use them for a den where they would get a ton of use. also, the assembly was easy, except for one hole that didn't line up. i also scotchguarded them. they really do look great.", 
    "The chair is quite comfy and the seat is quite large. I was disappointed with the color. Expected it to be much brighter. This is a dull shade of green. But the real issue are the legs. The legs are poorly built. The nuts which hold the screws in place keeping popping out. Had to call overstock to get both sets of legs replaced. The manufacturers for some reason thought that there was a issue with my installation so instead of sending the legs they just sent a notice to overstock to inform me that this was an installation issue. This message was never communicated to us; so we kept on waiting for new set of legs which never arrived. I ended up contacting Overstock again to find out my replacement leg request was in a limbo. I had to re-assure them that it was nt the installation that was the issue. Finally the manufacturer agreed to send us the new legs but they could only send it to us after the long weekend. So meanwhile I have two huge chairs lying un-assembled in my basement without any legs.", 
    "I bought these chairs about a month ago so I'm not sure how long they will last but they look very nice in my apartment. The only problem so far was that the legs did not look very sturdy when we were assembling them. it was very easy to put together, less than 10 minutes. They look great but not very sturdy, i guess you get what you paid for.", 
    "Easy to assemble. However, one of the legs seemed short and the chair wobbled. Switched the legs around and it still wobbled. Awaiting Overstock's response on a replacement. This chair is not turquoise, more on the green side. We liked it anyway for the accent. But if you have coordinated your room around the Turquoise color, you may be in for a surprise.", 
    "These chairs are exactly as they present on-line. I saw them featured in a magazine several months ago and saved the page. When I was ready to buy I was pleased they were available at O. The color is exactly as it appears on line, delivery was fast and assembly was quick and easy. I have them paired with a off white canvas slipcover couch, striped area rug ... and I love the look.", 
    "Just what my wife wanted. Looks great, perfect size.", 
    "I ordered these chairs for our living room. I had read previous reviews and was ready to use additional screws/glue if needed. As my husband and I put the chairs together, they seemed more sturdy than many of the previous reviewers had mentioned. We still used some wood glue when attaching the legs (just in case). So far, they are holding up well and are pretty comfortable.", 
    "Overall comfort and quality is good, except for the legs. The chairs add a lot of color into our space and we get compliments all the time. However, we had the same broken legs issues that others reported. One chair had the leg screws stripped and the other needed some gorilla glue to get them sturdy. I did contact Overstock with the issue of the stripped screws and they immediately took care of the issue and sent us two new chairs. If we didn't have the chair leg issues, I would've rated these higher. Value is there and I would still recommend, just know that you need a little work to fix the chair legs.", 
    "The turquoise color in these chairs are not as bright. Its a darker color turquoise with more of green than blue. They are beautiful. For example I painted my livingroom walls emerald coast by Behr and its almost an exact match to the chair", 
    "I bought the chairs for my daughter she loves them . the color is great ! the shipping was fast! My daughter put the chairs together by herself so assembly was very easy! the price was great too! I would recommend buying them!", 
    "love the color!! it was exactly as described and goes so well in our home.", 
    "Color matched web pic exactly. easy to assemble. Super comfy. Very convenient that they came as a pair set.", 
    "I love the way these chairs look!! They are a true turquoise!! They came in a timely manner too! The only thing that was a bit difficult was after we put the chairs together they rocked. Well they are not rocking chairs, so we took them apart and tightened them again, still rocked, changed the front legs. It worked!!! This would have been nice to know, if they were marked left or right!!! I am really excited to show them off!!!", 
    "The Damask chairs are true to the colour shown in the picture. I was hesitant to purchase them at first because they do not have arms, however I am so glad I did. The seat is very wide, meaning one can easily sit cross legged or curl up sideways on the chair without feelings as though one will fall off without the arms to lean on. They are very comfortable and make a nice colourful addition to our living room. Other reviewers have criticized the quality of the legs, however we have had no problems whatsoever and did not need to use any type of glue during assembly.", 
    "The fittings for the screws come out when you attempt to attach the legs. Nice chairs but not work the disappointment. Overstock was very helpful with having them picked up from my home and issuing a quick refund.", 
    "Even though these chairs are beautiful, the legs of the chair are poorly constructed. The reason why the legs may wobble is because the tee (nut) comes out of the legs once you screw in the bolt. So I placed Gorrilla Glue on the outside of the tee and in the holes of the legs. After I screwed the bolts back in, the legs were extremely sturdy.", 
    "I was so excited to recieve these chairs (I ordered 2 for my bedroom) and was highly disappointed.... The chairs were easy to assemble, but the legs are SO WOBBLY. The construction is poor. First, the pieces that were into the legs for the screws came loose immediately; they're held in place by two teeny tiny nails. One actually fell out completely. I even used wood glue, and they still wobble as soon as you sit down in them - mind you, I'm a pretty petite person, so the construction is just poor. I don't use them that often, thank goodness, because it also looks like the seat cushions and fabric will wear and manipulate easily. Although these were purchased several months ago, I am now strongly considering speaking with Overstock for a refund, replacement, or site credit.", 
    "Love the design. Is it truly aqua -- probably not. But I like very much.", 
    "This chair is true to the picture--beautiful color and a great size. Assembly was simple. This chair is a great buy!", 
    "Chairs look great and have received many compliments on them.", 
    "these chairs are absolutely beautiful and well made, my husband put them together in about 15 minutes, the color is spot-on.", 
    "Beautiful chairs. Not necessarily built for excessive wear and tear. They are great pieces and add life to any home that desires a touch of zest!!", 
    "Loved the chairs and they are gonna look great once we get our vision together!", 
    "These chairs are true to the picture. The color you see is the color you get. Beautiful chairs! I had to order 2 leg replacements because the metal hardware and nails came out. Thus they wobbled. Customer service is excellent and replacement with no hassle . If not were for the legs I would say this is an excellent piece. I am insecure if the legs will hold up. The assembly of them feel cheap. We shall see.", 
    "I LOVE THESE CHAIRS!!!! I have looked everywhere for something bold and bright for my new home. These chairs are perfect. The bottoms are wide and they look comfortable. I am sooo excited to put them together in my new living room :)", 
    "When I received the chairs, it took a couple of weeks to put together b/c i was in the processing of moving. When my husband put them together, the instructions were pretty simple and it appeared as the legs are now being labeled for easy and sturdy assembly. I loved the way they looked and once he was done, we both sat in them and they seem to very sturdy and secure.", 
    "Omg, there isn't even stars for this purchase. It's the perfect addition to my sitting room, first thing people see walking by the foyer, my friends and family LOVES it. It was fairly easy to ensemble , I did it myself and that's saying a lot because I'm such a Girlie girl, about 15 mins top. I'll surely encourage this purchase .", 
    "I researched a lot of accent chairs before finding these on overstock. I loved the pop of color it brought to my living area. My husband put it together pretty quickly and they now look great!", 
    "These chairs are absolutely gorgeous and good quality. They were very easy to put together and look excellent in the corner of my living room.", 
    "I LOVE these chairs!! I looked forever for chairs to compliment our living room and adjacent dining room. These are perfect. Beautiful color. The pattern is neutral enough to fit perfectly with other furniture/decor...not too over the top or loud. Just enough \"pop\". They were easy to put together. My husband and I put them together on the living room floor in less than 15 minutes. They are not lounge chairs, but actually very cushioned and comfortable. .", 
    "Great chairs for the price! Nice accent piece. We put them in the rec room to add a softer modern look. We would purchase them again or recommend them.", 
    "I love these chairs! Always get compliments! Only downfall was it took a while to put together.", 
    "Perfect for introducing the pop of color in informal the living room our vacation home. Directions were not very helpful. It took some tme to figure out how to attach the legs but was easy once I expermented and got it wrong at first. Other reviewers have commented on the leg bolts stripping out of the wood. They undoubtedly made the same mistake I did, by first installing the legs backwards, an easy mistake to make. The directions should clearly indicate and mark the way to instal the legs. Also,note that OverStock reviews posted under the single chair purchase or two-chair bundle of this item are different although the chairs are identical, just packaged two to a box instead of one. We first ordered two of these chairs then noticed the 2-chair price was lower. Had to cancel the first order and re place it for the double bundle. Not a problem but a nuisance. Packaging was good and delivery was unbelievably quick. Chair is reasonably comfortable.", 
    "My mom found the chairs online and I thought they were perfect for my new apartment. I moved in over the weekend and they could not be better- they were simple to put together and look exactly like the picture. I would highly recommend!", 
    "The seat is large and comfortable; they add just the right touch", 
    "What a great price for a pair chairs with some personality. They aren't heirloom quality, but I suspect they'll last for a while in our Family Room. When I put the first chair together, I observed what other reviewers mentioned: the instructions indicate that the front chair legs will be labeled as \"Right\" and \"Left.\" However, they are not labeled. So, I put both legs in and there didn't seem to a difference. I proceeded with screwing them in and they looked fine. It felt sturdy when I sat on it. However, when I assembled the second chair, the first leg I put in did not look right. I unscrewed it and put it in the other side - problem solved. This isn't a major problem, but it consumes unnecessary time. This problem has been reported by multiple customers, therefore Overstock should put some pressure on the manufacturer to improve their product.", 
    "I ordered this pair of chairs to go with the color scheme we have in our formal living room (greys, creams, yellows and aquas). One of the chairs went together without issue, but when I tried to assemble the other one, the metal \"female\" part that the bolt screws into became dislodged from the wooden leg. When I tried to unscrew the bolt, it and the metal receptacle would just spin around making it impossible to take off the leg. Because the leg was unstable and unable to be removed, I called customer service. They sent me a replacement and there were no issues with the new one. The chairs (aqua on an off-white background) look pretty and the pattern on both chairs lines up perfectly. They are by no means top-of-the-line, but are aesthetically pleasing and are perfect for use when we entertain. Great deal for the price and EXCELLENT customer service. In fact, I don't know of a company with better customer service than Overstock.", 
    "Love the chairs now my living room its complete, had a party and everyone loved the chairs they go well with my decor.", 
    "My overall experience was a good one - the end result was exactly as a I wanted, and two for this price is fantastic. They look gorgeous in my office and are very comfortable and a great addition to the room. My only complaint was in the overview stating they had \"minimal assembly\", when they actually required quite a bit of assembly. There are NOT a ton of parts, but they have to assembled perfectly or they don't line up correctly. The part you sit on in pre-assembled, but the legs need to be attached. This seems minor, but they are supposed to be marked for \"L\" or \"R\", which was not the case. After trying several times, they were stripped. I had an expert assist, but would have otherwise been stuck with wobbly chairs. I highly recommend this purchase, but just be prepared they may take some additional arm strength and patience when assembling.", 
    "Ordered these because the turquoise blue color seemed as if it would go perfect with my turquoise rug. Much to my surprise, these chairs were nowhere near turquoise blue. They are MUCH more green. I will be returning these.", 
    "the wood is soft so it has the potential not to last and the not as vibrant as on the screen."
  ], 
  "descrpition": "Brighten up your living area with this set of two armless chairs from angelo:HOME. These chairs sport a gorgeous damask fabric in a dramatic shade of turquoise to give your room a welcome infusion of color, while tapered legs with a dark espresso finish add extra aesthetic appeal.Dark espresso finish and turquoise and white upholstery provide timeless beautyHardwood construction ensures durabilityLow profile works in smaller rooms, including offices and living roomsDesigned by Angelo Surmelis for innovation and eleganceTapered legs in espresso finish enhance aesthetic appealSet of two for a complete lookMaterials can be recycledLow ratio of fossil fuel based materials, so you can feel good about your purchaseEasy to assembleLinen, polyester and viscose blend offers strength and softnessChairs measure 32.5\"H x 26\"W x 29\"DSeats measure 18.5\"H x 26\"W x 22\"DStyleModern, TraditionalMaterialCotton, Fabric, WoodFinishEspresso, WoodChair TypeAccent ChairsAssemblyAssembly RequiredChair Back HeightStandardColorBlueFurniture PatternPrint", 
  "link": "http://www.overstock.com/Home-Garden/angelo-HOME-Bradstreet-Damask-Turquoise-Blue-Armless-Chairs-Set-of-2/7467742/product.html?recset=ae644fcd-ef6d-4dcf-9ad0-029f6687883d&refccid=45UXE7Z4IL3IHXKO33MTWQ4DCQ&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7467742/angelo-HOME-Bradstreet-Damask-Turquoise-Blue-Armless-Chairs-Set-of-2-bba378ec-43ed-4bc3-ae6e-0e42b4fff31c_600.jpg"
  ]
}